ChipstackLTD/Zerobase/boards.txt
# See: https://arduino.github.io/arduino-cli/latest/platform-specification/

menu.pnum=Board Select
menu.clock=Clock Select
menu.xserial=U(S)ART support
menu.usb=USB support (if available)
menu.xusb=USB speed (if available)
menu.virtio=Virtual serial support

menu.opt=Optimize
menu.dbg=Debug symbols and core logs
menu.rtlib=C Runtime Library
menu.upload_method=Upload method

##############################################################################
##ZEROBASE Board   

ZEROBASE.name=Zerobase
ZEROBASE.build.core=arduino
ZEROBASE.build.board=ZEROBASE
ZEROBASE.build.extra_flags=-D BOARD_ZEROBASE
ZEROBASE.upload.maximum_size=0
ZEROBASE.upload.maximum_data_size=0
ZEROBASE.build.variant_h=variant_{build.board}.h
ZEROBASE.debug.tool=gdb-WCH_LinkE


#ZEROBASE Board
ZEROBASE.menu.pnum.CH32V003F4=Zerobase
ZEROBASE.menu.pnum.CH32V003F4.node=NODE_V003F4
ZEROBASE.menu.pnum.CH32V003F4.upload.maximum_size=16384
ZEROBASE.menu.pnum.CH32V003F4.upload.maximum_data_size=2048
ZEROBASE.menu.pnum.CH32V003F4.build.mcu=QingKe-V2A
ZEROBASE.menu.pnum.CH32V003F4.build.board=CH32V003F4
ZEROBASE.menu.pnum.CH32V003F4.build.series=CH32V00x
ZEROBASE.menu.pnum.CH32V003F4.build.variant=CH32V00x/CH32V003F4
ZEROBASE.menu.pnum.CH32V003F4.build.chip=CH32V003F4
ZEROBASE.menu.pnum.CH32V003F4.build.march=rv32ecxw
ZEROBASE.menu.pnum.CH32V003F4.build.mabi=ilp32e
ZEROBASE.menu.pnum.CH32V003F4.build.math_lib_gcc=-lm
ZEROBASE.menu.pnum.CH32V003F4.build.IQ_math_RV32=
ZEROBASE.menu.pnum.CH32V003F4.build.ch_extra_lib=-lprintf


# Upload menu
ZEROBASE.menu.upload_method.minichlink=minichlink
ZEROBASE.menu.upload_method.minichlink.upload.protocol=
ZEROBASE.menu.upload_method.minichlink.upload.options=
ZEROBASE.menu.upload_method.minichlink.upload.tool=minichlink
#ZEROBASE.menu.upload_method.swdMethod=WCH-SWD
#ZEROBASE.menu.upload_method.swdMethod.upload.protocol=
#ZEROBASE.menu.upload_method.swdMethod.upload.options=
#ZEROBASE.menu.upload_method.swdMethod.upload.tool=WCH_linkE
#ZEROBASE.menu.upload_method.ispMethod=WCH-ISP
#ZEROBASE.menu.upload_method.ispMethod.upload.protocol=
#ZEROBASE.menu.upload_method.ispMethod.upload.options=
#ZEROBASE.menu.upload_method.ispMethod.upload.tool=wchisp


# Clock Select
ZEROBASE.menu.clock.48MHz_HSI=48MHz Internal
ZEROBASE.menu.clock.48MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_48MHz_HSI=48000000 -DF_CPU=48000000
ZEROBASE.menu.clock.24MHz_HSI=24MHz Internal
ZEROBASE.menu.clock.24MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_24MHz_HSI=24000000 -DF_CPU=24000000
ZEROBASE.menu.clock.8MHz_HSI=8MHz Internal
ZEROBASE.menu.clock.8MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_8MHz_HSI=8000000 -DF_CPU=8000000
ZEROBASE.menu.clock.48MHz_HSE=48MHz External
ZEROBASE.menu.clock.48MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_48MHz_HSE=48000000 -DF_CPU=48000000
ZEROBASE.menu.clock.24MHz_HSE=24MHz External
ZEROBASE.menu.clock.24MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_24MHz_HSE=24000000 -DF_CPU=24000000
ZEROBASE.menu.clock.8MHz_HSE=8MHz External
ZEROBASE.menu.clock.8MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_8MHz_HSE=8000000 -DF_CPU=8000000


# Optimizations
ZEROBASE.menu.opt.osstd=Smallest (-Os default)
ZEROBASE.menu.opt.osstd.build.flags.optimize=-Os
ZEROBASE.menu.opt.oslto=Smallest (-Os) with LTO
ZEROBASE.menu.opt.oslto.build.flags.optimize=-Os -flto
ZEROBASE.menu.opt.o1std=Fast (-O1)
ZEROBASE.menu.opt.o1std.build.flags.optimize=-O1
ZEROBASE.menu.opt.o1lto=Fast (-O1) with LTO
ZEROBASE.menu.opt.o1lto.build.flags.optimize=-O1 -flto
ZEROBASE.menu.opt.o2std=Faster (-O2)
ZEROBASE.menu.opt.o2std.build.flags.optimize=-O2
ZEROBASE.menu.opt.o2lto=Faster (-O2) with LTO
ZEROBASE.menu.opt.o2lto.build.flags.optimize=-O2 -flto
ZEROBASE.menu.opt.o3std=Fastest (-O3)
ZEROBASE.menu.opt.o3std.build.flags.optimize=-O3
ZEROBASE.menu.opt.o3lto=Fastest (-O3) with LTO
ZEROBASE.menu.opt.o3lto.build.flags.optimize=-O3 -flto
ZEROBASE.menu.opt.ogstd=Debug (-Og)
ZEROBASE.menu.opt.ogstd.build.flags.optimize=-Og
ZEROBASE.menu.opt.o0std=No Optimization (-O0)
ZEROBASE.menu.opt.o0std.build.flags.optimize=-O0


# Debug information
ZEROBASE.menu.dbg.none=None
ZEROBASE.menu.dbg.none.build.flags.debug=-DNDEBUG
ZEROBASE.menu.dbg.enable_sym=Symbols Enabled (-g)
ZEROBASE.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
ZEROBASE.menu.dbg.enable_log=Core logs Enabled
ZEROBASE.menu.dbg.enable_log.build.flags.debug=
ZEROBASE.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
ZEROBASE.menu.dbg.enable_all.build.flags.debug=-g


# C Runtime Library
ZEROBASE.menu.rtlib.nano=Newlib Nano (default)
ZEROBASE.menu.rtlib.nano.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs
ZEROBASE.menu.rtlib.nanofp=Newlib Nano + Float Printf
ZEROBASE.menu.rtlib.nanofp.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _printf_float
ZEROBASE.menu.rtlib.nanofs=Newlib Nano + Float Scanf
ZEROBASE.menu.rtlib.nanofs.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _scanf_float
ZEROBASE.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
ZEROBASE.menu.rtlib.nanofps.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _printf_float -u _scanf_float
ZEROBASE.menu.rtlib.full=Newlib Standard
ZEROBASE.menu.rtlib.full.build.flags.ldflags=--specs=nosys.specs



##############################################################################
##ZEROBASE_2 Board   

ZEROBASE_2.name=Zerobase 2
ZEROBASE_2.build.core=arduino
ZEROBASE_2.build.board=ZEROBASE_2
ZEROBASE_2.build.extra_flags=-D BOARD_ZEROBASE2
ZEROBASE_2.upload.maximum_size=0
ZEROBASE_2.upload.maximum_data_size=0
ZEROBASE_2.build.variant_h=variant_{build.board}.h
ZEROBASE_2.debug.tool=gdb-WCH_LinkE

#ZEROBASE_2 Board
ZEROBASE_2.menu.pnum.CH32V203C8=ZEROBASE 2
ZEROBASE_2.menu.pnum.CH32V203C8.node=NODE_V203C8
ZEROBASE_2.menu.pnum.CH32V203C8.upload.maximum_size=65536
ZEROBASE_2.menu.pnum.CH32V203C8.upload.maximum_data_size=20480
ZEROBASE_2.menu.pnum.CH32V203C8.build.mcu=QingKe-V4B
ZEROBASE_2.menu.pnum.CH32V203C8.build.board=CH32V203C8
ZEROBASE_2.menu.pnum.CH32V203C8.build.series=CH32V20x
ZEROBASE_2.menu.pnum.CH32V203C8.build.variant=CH32V20x/CH32V203C8
ZEROBASE_2.menu.pnum.CH32V203C8.build.chip=CH32V203
ZEROBASE_2.menu.pnum.CH32V203C8.build.march=rv32imacxw
ZEROBASE_2.menu.pnum.CH32V203C8.build.mabi=ilp32
ZEROBASE_2.menu.pnum.CH32V203C8.build.math_lib_gcc=-lm
ZEROBASE_2.menu.pnum.CH32V203C8.build.IQ_math_RV32=
ZEROBASE_2.menu.pnum.CH32V203C8.build.ch_extra_lib=-lprintf


# USB support
ZEROBASE_2.menu.usb.none=None
ZEROBASE_2.menu.usb.none.build.usb_flags=
ZEROBASE_2.menu.usb.tinyusb_usbd=Adafruit TinyUSB with USBD
ZEROBASE_2.menu.usb.tinyusb_usbd.build.usb_flags=-DUSBCON -DUSE_TINYUSB -DCFG_TUD_WCH_USBIP_FSDEV=1 "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
ZEROBASE_2.menu.usb.tinyusb_usbfs=Adafruit TinyUSB with USBFS
ZEROBASE_2.menu.usb.tinyusb_usbfs.build.usb_flags=-DUSBCON -DUSE_TINYUSB -DCFG_TUD_WCH_USBIP_USBFS=1 "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"

# Upload menu
ZEROBASE_2.menu.upload_method.ispMethod=WCH-ISP
ZEROBASE_2.menu.upload_method.ispMethod.upload.protocol=
ZEROBASE_2.menu.upload_method.ispMethod.upload.options=
ZEROBASE_2.menu.upload_method.ispMethod.upload.tool=wchisp


# Clock Select
ZEROBASE_2.menu.clock.144MHz_HSI=144MHz Internal
ZEROBASE_2.menu.clock.144MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_144MHz_HSI=144000000 -DF_CPU=144000000
ZEROBASE_2.menu.clock.120MHz_HSI=120MHz Internal
ZEROBASE_2.menu.clock.120MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_120MHz_HSI=120000000 -DF_CPU=120000000
ZEROBASE_2.menu.clock.96MHz_HSI=96MHz Internal
ZEROBASE_2.menu.clock.96MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_96MHz_HSI=96000000 -DF_CPU=96000000
ZEROBASE_2.menu.clock.72MHz_HSI=72MHz Internal
ZEROBASE_2.menu.clock.72MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_72MHz_HSI=72000000 -DF_CPU=72000000
ZEROBASE_2.menu.clock.56MHz_HSI=56MHz Internal
ZEROBASE_2.menu.clock.56MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_56MHz_HSI=56000000 -DF_CPU=56000000
ZEROBASE_2.menu.clock.48MHz_HSI=48MHz Internal
ZEROBASE_2.menu.clock.48MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_48MHz_HSI=48000000 -DF_CPU=48000000
ZEROBASE_2.menu.clock.HSI=HSI Internal
ZEROBASE_2.menu.clock.HSI.build.flags.clock=-DSYSCLK_FREQ_HSI=HSI_VALUE -DF_CPU=HSI_VALUE
ZEROBASE_2.menu.clock.144MHz_HSE=144MHz External
ZEROBASE_2.menu.clock.144MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_144MHz_HSE=144000000 -DF_CPU=144000000
ZEROBASE_2.menu.clock.120MHz_HSE=120MHz External
ZEROBASE_2.menu.clock.120MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_120MHz_HSE=120000000 -DF_CPU=120000000
ZEROBASE_2.menu.clock.96MHz_HSE=96MHz External
ZEROBASE_2.menu.clock.96MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_96MHz_HSE=96000000 -DF_CPU=96000000
ZEROBASE_2.menu.clock.72MHz_HSE=72MHz External
ZEROBASE_2.menu.clock.72MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_72MHz_HSE=72000000 -DF_CPU=72000000
ZEROBASE_2.menu.clock.56MHz_HSE=56MHz External
ZEROBASE_2.menu.clock.56MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_56MHz_HSE=56000000 -DF_CPU=56000000
ZEROBASE_2.menu.clock.48MHz_HSE=48MHz External
ZEROBASE_2.menu.clock.48MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_48MHz_HSE=48000000 -DF_CPU=48000000
ZEROBASE_2.menu.clock.HSE=HSE External
ZEROBASE_2.menu.clock.HSE.build.flags.clock=-DSYSCLK_FREQ_HSE=HSE_VALUE -DF_CPU=HSE_VALUE


# Optimizations
ZEROBASE_2.menu.opt.osstd=Smallest (-Os default)
ZEROBASE_2.menu.opt.osstd.build.flags.optimize=-Os
ZEROBASE_2.menu.opt.oslto=Smallest (-Os) with LTO
ZEROBASE_2.menu.opt.oslto.build.flags.optimize=-Os -flto
ZEROBASE_2.menu.opt.o1std=Fast (-O1)
ZEROBASE_2.menu.opt.o1std.build.flags.optimize=-O1
ZEROBASE_2.menu.opt.o1lto=Fast (-O1) with LTO
ZEROBASE_2.menu.opt.o1lto.build.flags.optimize=-O1 -flto
ZEROBASE_2.menu.opt.o2std=Faster (-O2)
ZEROBASE_2.menu.opt.o2std.build.flags.optimize=-O2
ZEROBASE_2.menu.opt.o2lto=Faster (-O2) with LTO
ZEROBASE_2.menu.opt.o2lto.build.flags.optimize=-O2 -flto
ZEROBASE_2.menu.opt.o3std=Fastest (-O3)
ZEROBASE_2.menu.opt.o3std.build.flags.optimize=-O3
ZEROBASE_2.menu.opt.o3lto=Fastest (-O3) with LTO
ZEROBASE_2.menu.opt.o3lto.build.flags.optimize=-O3 -flto
ZEROBASE_2.menu.opt.ogstd=Debug (-Og)
ZEROBASE_2.menu.opt.ogstd.build.flags.optimize=-Og
ZEROBASE_2.menu.opt.o0std=No Optimization (-O0)
ZEROBASE_2.menu.opt.o0std.build.flags.optimize=-O0


# Debug information
ZEROBASE_2.menu.dbg.none=None
ZEROBASE_2.menu.dbg.none.build.flags.debug=-DNDEBUG
ZEROBASE_2.menu.dbg.enable_sym=Symbols Enabled (-g)
ZEROBASE_2.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
ZEROBASE_2.menu.dbg.enable_log=Core logs Enabled
ZEROBASE_2.menu.dbg.enable_log.build.flags.debug=
ZEROBASE_2.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
ZEROBASE_2.menu.dbg.enable_all.build.flags.debug=-g


# C Runtime Library
ZEROBASE_2.menu.rtlib.nano=Newlib Nano (default)
ZEROBASE_2.menu.rtlib.nano.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs
ZEROBASE_2.menu.rtlib.nanofp=Newlib Nano + Float Printf
ZEROBASE_2.menu.rtlib.nanofp.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _printf_float
ZEROBASE_2.menu.rtlib.nanofs=Newlib Nano + Float Scanf
ZEROBASE_2.menu.rtlib.nanofs.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _scanf_float
ZEROBASE_2.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
ZEROBASE_2.menu.rtlib.nanofps.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _printf_float -u _scanf_float
ZEROBASE_2.menu.rtlib.full=Newlib Standard
ZEROBASE_2.menu.rtlib.full.build.flags.ldflags=--specs=nosys.specs